In [35]:
import pandas as pd

df = pd.read_csv("rapido_data.csv")
df

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method
0,bike,2024-06-23,19:18:20,completed,Banashankari 7th Stage,Richmond Road,99,RD8660319589404637,18.68,93.09,2.32,95.41,Amazon Pay
1,bike lite,2024-07-06,2:42:20,completed,Indiranagar North,Sahakar Nagar,48,RD4484661533610497,42.55,420.77,11.68,432.45,QR scan
2,parcel,2024-07-19,17:55:20,completed,MG Road Mahatma Gandhi Road,Whitefield South,112,RD1526455182706880,5.85,247.90,27.45,275.35,GPay
3,bike,2024-07-20,5:38:20,cancelled,JP Nagar,Rajajinagar 7th Block,45,RD7207154929912440,16.64,NaN,NaN,NaN,NaN
4,cab economy,2024-07-12,19:36:20,completed,Whitefield North,Brigade Road Eva Mall,44,RD6627722888214728,5.61,786.30,21.40,807.70,Paytm
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,auto,2024-07-01,9:57:20,cancelled,Brigade Road Mota Royal Arcade,Neelasandra,120,RD8489738606219832,10.70,NaN,NaN,NaN,NaN
9996,auto share,2024-07-10,2:47:20,completed,Frazer Town,MG Road Cubbon Park,71,RD9340718348411258,13.27,124.72,23.24,147.96,phonePy
9997,auto share,2024-07-06,23:56:20,cancelled,Brigade Road Church Street,HSR Layout Sector 5 North,71,RD9632805396891647,2.41,NaN,NaN,NaN,NaN
9998,cab premium,2024-07-23,6:10:20,cancelled,Rajajinagar 2nd Block,HSR Layout Central,26,RD1640451808051338,45.75,NaN,NaN,NaN,NaN
9999,cab economy,2024-07-20,7:42:20,completed,Hebbal North,HSR Layout Sector 10,88,RD3004823158884110,19.86,565.39,46.42,611.81,Paytm

In [36]:
df.head(7)

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method
0,bike,2024-06-23,19:18:20,completed,Banashankari 7th Stage,Richmond Road,99,RD8660319589404637,18.68,93.09,2.32,95.41,Amazon Pay
1,bike lite,2024-07-06,2:42:20,completed,Indiranagar North,Sahakar Nagar,48,RD4484661533610497,42.55,420.77,11.68,432.45,QR scan
2,parcel,2024-07-19,17:55:20,completed,MG Road Mahatma Gandhi Road,Whitefield South,112,RD1526455182706880,5.85,247.90,27.45,275.35,GPay
3,bike,2024-07-20,5:38:20,cancelled,JP Nagar,Rajajinagar 7th Block,45,RD7207154929912440,16.64,NaN,NaN,NaN,NaN
4,cab economy,2024-07-12,19:36:20,completed,Whitefield North,Brigade Road Eva Mall,44,RD6627722888214728,5.61,786.30,21.40,807.70,Paytm
5,bike lite,2024-07-07,20:01:20,cancelled,Indiranagar 7th Stage,Jayanagar,32,RD3945488262242659,48.96,NaN,NaN,NaN,NaN
6,bike lite,2024-07-01,22:54:20,completed,Kadubeesanahalli,Banashankari 2nd Stage,30,RD1872668675732568,11.61,685.89,6.11,692.00,Amazon Pay

In [37]:
df.tail(3)

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method
9997,auto share,2024-07-06,23:56:20,cancelled,Brigade Road Church Street,HSR Layout Sector 5 North,71,RD9632805396891647,2.41,NaN,NaN,NaN,NaN
9998,cab premium,2024-07-23,6:10:20,cancelled,Rajajinagar 2nd Block,HSR Layout Central,26,RD1640451808051338,45.75,NaN,NaN,NaN,NaN
9999,cab economy,2024-07-20,7:42:20,completed,Hebbal North,HSR Layout Sector 10,88,RD3004823158884110,19.86,565.39,46.42,611.81,Paytm

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   services        10000 non-null  object
 1   date            10000 non-null  object
 2   time            10000 non-null  object
 3   ride_status     10000 non-null  object
 4   source          10000 non-null  object
 5   destination     10000 non-null  object
 6   duration        10000 non-null  int64
 7   ride_id         10000 non-null  object
 8   distance        10000 non-null  float64
 9   ride_charge     4611 non-null   float64
 10  misc_charge     4611 non-null   float64
 11  total_fare      4611 non-null   float64
 12  payment_method  4611 non-null   object
dtypes: float64(4), int64(1), object(8)
memory usage: 1015.8+ KB

In [39]:
df.isna().sum()

services             0
date                 0
time                 0
ride_status          0
source               0
destination          0
duration             0
ride_id              0
distance             0
ride_charge       5389
misc_charge       5389
total_fare        5389
payment_method    5389
dtype: int64

In [40]:
True + True + False

2

In [41]:
# df.dropna(inplace=True)

In [42]:
df.isnull().sum()

services             0
date                 0
time                 0
ride_status          0
source               0
destination          0
duration             0
ride_id              0
distance             0
ride_charge       5389
misc_charge       5389
total_fare        5389
payment_method    5389
dtype: int64

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   services        10000 non-null  object
 1   date            10000 non-null  object
 2   time            10000 non-null  object
 3   ride_status     10000 non-null  object
 4   source          10000 non-null  object
 5   destination     10000 non-null  object
 6   duration        10000 non-null  int64
 7   ride_id         10000 non-null  object
 8   distance        10000 non-null  float64
 9   ride_charge     4611 non-null   float64
 10  misc_charge     4611 non-null   float64
 11  total_fare      4611 non-null   float64
 12  payment_method  4611 non-null   object
dtypes: float64(4), int64(1), object(8)
memory usage: 1015.8+ KB

In [44]:
df.date

0       2024-06-23
1       2024-07-06
2       2024-07-19
3       2024-07-20
4       2024-07-12
           ...
9995    2024-07-01
9996    2024-07-10
9997    2024-07-06
9998    2024-07-23
9999    2024-07-20
Name: date, Length: 10000, dtype: object

In [45]:
df['datetime'] = pd.to_datetime(df.date+" "+df.time)

In [46]:
df.head()

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method,datetime
0,bike,2024-06-23,19:18:20,completed,Banashankari 7th Stage,Richmond Road,99,RD8660319589404637,18.68,93.09,2.32,95.41,Amazon Pay,2024-06-23 19:18:20
1,bike lite,2024-07-06,2:42:20,completed,Indiranagar North,Sahakar Nagar,48,RD4484661533610497,42.55,420.77,11.68,432.45,QR scan,2024-07-06 02:42:20
2,parcel,2024-07-19,17:55:20,completed,MG Road Mahatma Gandhi Road,Whitefield South,112,RD1526455182706880,5.85,247.90,27.45,275.35,GPay,2024-07-19 17:55:20
3,bike,2024-07-20,5:38:20,cancelled,JP Nagar,Rajajinagar 7th Block,45,RD7207154929912440,16.64,NaN,NaN,NaN,NaN,2024-07-20 05:38:20
4,cab economy,2024-07-12,19:36:20,completed,Whitefield North,Brigade Road Eva Mall,44,RD6627722888214728,5.61,786.30,21.40,807.70,Paytm,2024-07-12 19:36:20

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   services        10000 non-null  object
 1   date            10000 non-null  object
 2   time            10000 non-null  object
 3   ride_status     10000 non-null  object
 4   source          10000 non-null  object
 5   destination     10000 non-null  object
 6   duration        10000 non-null  int64
 7   ride_id         10000 non-null  object
 8   distance        10000 non-null  float64
 9   ride_charge     4611 non-null   float64
 10  misc_charge     4611 non-null   float64
 11  total_fare      4611 non-null   float64
 12  payment_method  4611 non-null   object
 13  datetime        10000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(4), int64(1), object(8)
memory usage: 1.1+ MB

In [48]:
df.datetime

0      2024-06-23 19:18:20
1      2024-07-06 02:42:20
2      2024-07-19 17:55:20
3      2024-07-20 05:38:20
4      2024-07-12 19:36:20
               ...
9995   2024-07-01 09:57:20
9996   2024-07-10 02:47:20
9997   2024-07-06 23:56:20
9998   2024-07-23 06:10:20
9999   2024-07-20 07:42:20
Name: datetime, Length: 10000, dtype: datetime64[ns]

In [49]:
df.datetime.dt.year

0       2024
1       2024
2       2024
3       2024
4       2024
        ...
9995    2024
9996    2024
9997    2024
9998    2024
9999    2024
Name: datetime, Length: 10000, dtype: int32

In [50]:
df.datetime.dt.month

0       6
1       7
2       7
3       7
4       7
       ..
9995    7
9996    7
9997    7
9998    7
9999    7
Name: datetime, Length: 10000, dtype: int32

In [51]:
df.datetime.dt.day

0       23
1        6
2       19
3       20
4       12
        ..
9995     1
9996    10
9997     6
9998    23
9999    20
Name: datetime, Length: 10000, dtype: int32

In [52]:
df.datetime.dt.hour

0       19
1        2
2       17
3        5
4       19
        ..
9995     9
9996     2
9997    23
9998     6
9999     7
Name: datetime, Length: 10000, dtype: int32

In [53]:
df.datetime.dt.minute

0       18
1       42
2       55
3       38
4       36
        ..
9995    57
9996    47
9997    56
9998    10
9999    42
Name: datetime, Length: 10000, dtype: int32

In [54]:
df.datetime.dt.second

0       20
1       20
2       20
3       20
4       20
        ..
9995    20
9996    20
9997    20
9998    20
9999    20
Name: datetime, Length: 10000, dtype: int32

In [55]:
df.datetime.dt.day_name()

0          Sunday
1        Saturday
2          Friday
3        Saturday
4          Friday
          ...
9995       Monday
9996    Wednesday
9997     Saturday
9998      Tuesday
9999     Saturday
Name: datetime, Length: 10000, dtype: object

In [56]:
df.datetime.dt.month_name()

0       June
1       July
2       July
3       July
4       July
        ...
9995    July
9996    July
9997    July
9998    July
9999    July
Name: datetime, Length: 10000, dtype: object

In [57]:
df.shape

(10000, 14)

In [58]:
df.services.value_counts()

services
auto           1479
auto share     1473
cab premium    1448
bike lite      1424
cab economy    1406
bike           1388
parcel         1382
Name: count, dtype: int64

In [60]:
df.date.value_counts()

date
2024-06-30    362
2024-07-06    350
2024-07-13    348
2024-07-23    347
2024-07-07    346
2024-06-24    345
2024-07-02    344
2024-07-19    337
2024-06-26    334
2024-06-27    334
2024-07-03    333
2024-06-29    331
2024-07-21    327
2024-07-05    327
2024-06-28    323
2024-07-11    321
2024-07-17    318
2024-07-14    316
2024-07-15    316
2024-07-22    315
2024-07-09    314
2024-06-25    314
2024-07-01    314
2024-07-12    312
2024-07-08    311
2024-07-16    308
2024-07-04    302
2024-06-23    292
2024-07-20    292
2024-07-10    286
2024-07-18    281
Name: count, dtype: int64

In [64]:
df.datetime.dt.hour.value_counts()

datetime
8     470
2     444
9     442
23    438
15    436
17    434
21    428
19    427
1     423
20    422
5     419
13    418
18    412
7     411
12    410
4     409
10    407
16    402
0     401
11    401
22    398
6     391
14    380
3     377
Name: count, dtype: int64

In [67]:
df.datetime.dt.day_name().value_counts()

datetime
Sunday       1643
Tuesday      1627
Monday       1601
Saturday     1321
Friday       1299
Wednesday    1271
Thursday     1238
Name: count, dtype: int64

In [71]:
df.datetime.dt.day_name().value_counts()

datetime
Sunday       1643
Tuesday      1627
Monday       1601
Saturday     1321
Friday       1299
Wednesday    1271
Thursday     1238
Name: count, dtype: int64

In [72]:
df.head()

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method,datetime
0,bike,2024-06-23,19:18:20,completed,Banashankari 7th Stage,Richmond Road,99,RD8660319589404637,18.68,93.09,2.32,95.41,Amazon Pay,2024-06-23 19:18:20
1,bike lite,2024-07-06,2:42:20,completed,Indiranagar North,Sahakar Nagar,48,RD4484661533610497,42.55,420.77,11.68,432.45,QR scan,2024-07-06 02:42:20
2,parcel,2024-07-19,17:55:20,completed,MG Road Mahatma Gandhi Road,Whitefield South,112,RD1526455182706880,5.85,247.90,27.45,275.35,GPay,2024-07-19 17:55:20
3,bike,2024-07-20,5:38:20,cancelled,JP Nagar,Rajajinagar 7th Block,45,RD7207154929912440,16.64,NaN,NaN,NaN,NaN,2024-07-20 05:38:20
4,cab economy,2024-07-12,19:36:20,completed,Whitefield North,Brigade Road Eva Mall,44,RD6627722888214728,5.61,786.30,21.40,807.70,Paytm,2024-07-12 19:36:20

In [75]:
df.groupby('services')['total_fare'].sum()

services
auto           391063.19
auto share     346887.26
bike           321782.00
bike lite      354782.15
cab economy    334850.51
cab premium    345342.95
parcel         351449.30
Name: total_fare, dtype: float64

In [76]:
df.head()

,services,date,time,ride_status,source,destination,duration,ride_id,distance,ride_charge,misc_charge,total_fare,payment_method,datetime
0,bike,2024-06-23,19:18:20,completed,Banashankari 7th Stage,Richmond Road,99,RD8660319589404637,18.68,93.09,2.32,95.41,Amazon Pay,2024-06-23 19:18:20
1,bike lite,2024-07-06,2:42:20,completed,Indiranagar North,Sahakar Nagar,48,RD4484661533610497,42.55,420.77,11.68,432.45,QR scan,2024-07-06 02:42:20
2,parcel,2024-07-19,17:55:20,completed,MG Road Mahatma Gandhi Road,Whitefield South,112,RD1526455182706880,5.85,247.90,27.45,275.35,GPay,2024-07-19 17:55:20
3,bike,2024-07-20,5:38:20,cancelled,JP Nagar,Rajajinagar 7th Block,45,RD7207154929912440,16.64,NaN,NaN,NaN,NaN,2024-07-20 05:38:20
4,cab economy,2024-07-12,19:36:20,completed,Whitefield North,Brigade Road Eva Mall,44,RD6627722888214728,5.61,786.30,21.40,807.70,Paytm,2024-07-12 19:36:20

In [81]:
df.shape

(10000, 14)

In [79]:
(df.ride_status == "cancelled").sum()

np.int64(5389)

In [82]:
(df.ride_status == "completed").sum()

np.int64(4611)

In [2]:
import pandas as pd
import numpy as np
# Create the DataFrame
data = {
    "Name": ["Rahul", "Priya", "Riya", "-"],
    "Gender": ["Male", "F", "female", "Male"],
    "Age": [18, 19, 18, 20],
    "Marks": [88, np.nan, 76, 54],
    "City": ["Bangalore", "Mumbai", "Delhi", "Banglore"],
    "Attendance (%)": [92, 85, np.nan, 90]
}
df = pd.DataFrame(data)
df

    Name  Gender  Age  Marks       City  Attendance (%)
0  Rahul    Male   18   88.0  Bangalore            92.0
1  Priya       F   19    NaN     Mumbai            85.0
2   Riya  female   18   76.0      Delhi             NaN
3      -    Male   20   54.0   Banglore            90.0

In [93]:
(df.distance > 40).sum()

np.int64(2066)

In [99]:
cond1 = df.services == 'bike'
cond2 = df.distance > 40
df[cond1 & cond2].shape

(288, 14)